Repository: yichenhock/GF2
Catalog: logsim/locale/*/LC_MESSAGES/logsim_translation.po
Languages: fr

source: Application must be run with a circuit definition file.
fr: L'application doit être exécutée avec un fichier de définition de circuit.

source: Output
fr: Sortie

source: Circuit Definition
fr: Définition du circuit

source: Inputs
fr: Entrées

source: Monitors
fr: Ecrans

source: Logic Simulator: interactive graphical user interface. Enter 'h' for help.
fr: Simulateur Logique : interface utilisateur graphique interactive. Entrez 'h' pour l'aide.

source: &About
fr: &À Propos de

source: &Save As
fr: &Enregistrer

source: &Exit
fr: &Sortie

source: &File
fr: &Fichier

source: Browse
fr: Naviguer

source: Browse for a file
fr: Naviguer pour un fichier

source: Save
fr: Enregistrer

source: Save the file
fr: Enregistrer ce fichier

source: New
fr: Nouveau

source: Create a new file
fr: Créer un nouveau fichier

source: Compile
fr: Compiler

source: Compile the circuit definition
fr: Compiler le definition du circuit

source: Run
fr: Exécuter

source: Run the simulation
fr: Exécuter la simulation

source: Continue
fr: Continuer

source: Continue the simulation
fr: Continuer la simulation

source: Reset
fr: Réinitialiser

source: Reset the simulation
fr: Réinitialiser la simulation

source: Save Plot
fr: Enregistrer le graphe

source: Save signal trace as an image
fr: Enregistrer la trace de signal comme une image

source: Help
fr: Aide

source: Quit
fr: Quitter

source: Quit Logic Simulator
fr: Quitter la simulateur logique

source: Logic Simulator Created by Yi Chen Hock, Michael Stevens and Cindy Wu 2022
fr: Simulateur Logique Créé par Yi Chen Hock, Michael Stevens et Cindy Wu 2022

source: About Logsim
fr: À Propos de Logsim

source: Number of simulation cycles set to: {}
fr: Nombre de cycles de simulation mis a: {}

source: Changes you made may not be saved.
fr: Changements vous avez fait ne peuvent pas être enregistrés

source: Quit application?
fr: Quitter l'application?

source: Compiling...
fr: Compilant...

source: File saved and compiled successfully.
fr: Fichier enregistré et compile bien

source: File compiled with errors.
fr: Fichier compiler non bien

source: Parser failed to work :(
fr: Quelle dommage :(

source: No monitors.
fr: Aucun ecrans

source: Run button pressed.
fr: Exécuter pressé

source: Continue button pressed.
fr: Continuer pressé

source: Simulation reset.
fr: Réinitialiser la simulation

source: Reset button pressed.
fr: Exécuter pressé

source: Open a new file?
fr: Créer un nouveau fichier

source: Open File
fr: Ouvrir un fichier

source: Error opening file.
fr: Erreur dans ouvrature

source: Error
fr: Erreur

source: Save File
fr: Enregistrer le fichier

source: new_definition_file
fr: nouveau_fichier

source: Text documents
fr: Documents de texte

source: Error creating file.
fr: Erreur dans creation

source: File created successfully in {}
fr: Fichier créé {}

source: PNG files
fr: PNG fichier

source: Error saving file.
fr: Erreur dans enregistrement

source: File saved.
fr: Fichier enregistré

source: Canvas redrawn on paint event, size is
fr: La toile redessiné sur paint evenemt taille est

source: Reset the simulation first to edit!
fr: Réinitialiser la simulation avant d'éditer !

source: Type commands here
fr: Saisissez les commandes par ici

source: Error! Invalid command!
fr: Erreur ! Commande invalide !

source: User commands:
fr: Commandes d'user:

source: run the simulation for N cycles
fr: Exécuter la simulation pour N cycles

source: (from scratch)
fr: (A partir de rien)

source: continue the simulation for N
fr: Continuer la simulation pour N

source: set switch X to N (0 or 1)
fr: Mettre switch X a N (0 ou 1)

source: help (this command)
fr: Aider (ce commande)

source: Successfully set switch.
fr: Switch mis avec succes

source: Error! Invalid switch.
fr: Erreur ! Switch invalide

source: Error! Network oscillating.
fr: Erreur ! Network oscille

source: Running for
fr: Exécutant pour

source: Error! Nothing to continue. Run first.
fr: Erreur ! Rien a continuer. Exécutez avant

source: Continuing for
fr: Continuant pour

source: Total:
fr: Totale:

source: Error! Expected a name.
fr: Erreur ! Expecté un nom

source: Error! Unknown name.
fr: Erreur ! Nom inconnu

source: Error! Expected a number.
fr: Erreur ! Expecté un nombre

source: Number out of range.
fr: Nombre hors de portée

source: State
fr: État

source: ON
fr: Activé

source: OFF
fr: Deactivé

source: Set switch {} to 1.
fr: Mettre switch {} a 1

source: Switch {} set to 1.
fr: Switch {} mis a 1

source: Set switch {} to 0.
fr: Mettre switch {} a 0

source: Switch {} set to 0.
fr: Switch {} mis a 0

source: All
fr: Tout

source: Gate
fr: Porte

source: Clock
fr: Horloge

source: Name
fr: Nom

source: Add
fr: Ajouter

source: Add All
fr: Ajouter tout

source: Add Component To Monitor
fr: Ajouter component a écran

source: Remove
fr: Enlever

source: Select a component first!
fr: Selectez component avant

source: Component already added!
fr: Component déja ajouté

source: Added component to monitor.
fr: Component ajouté a écran

source: Component removed from monitor.
fr: Component enlevé d'écran

source: {} removed from monitor.
fr: {} enlevé d'écran

source: Reset simulation to add components!
fr: Réinitialiser la simulation pour ajouter components

source: Logic Simulator
fr: Simulateur Logique

source: The I18N sample application
fr: L'application échantillon I18N

source: Close
fr: Fermer

source: Close the application
fr: Fermer l'application

source: Edit something
fr: Éditer quelquechose

source: Edit an entry of something
fr: Éditer une entrée de quelquechose

source: &Edit
fr: &Éditer

source: About the program
fr: A propos du programme

source: &Help
fr: &Aider

source: A nice label for the TextCtrl
fr: Un bon label pour le TextCtrl

source: a search control
fr: Une control de cherche

source: Open a file dialog
fr: Ouvrir un fichier dialog

source: Choose a file
fr: Choisir un fichier
